# ETL program

In [ ]:
# 파라미터 테이블 생성 쿼리

# SELECT *
# FROM KOPO_PARAM_HANJIWON;

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('SRC_TABLE', 'kopo_bankdata');

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('SRC_CON', 'mysql+pymysql://kopo:kopo@192.168.110.111:3306/kopo'); 

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('DEST_TABLE', 'kopo_bankdata_hanjiwon'); 

# INSERT INTO KOPO_PARAM_HANJIWON
# VALUES ('DEST_CON', 'oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl');

# 1. 파라미터 테이블 불러오기

In [24]:
import pandas as pd
from sqlalchemy import create_engine,types
id = "kopo"
pw = "kopo"
ip = "192.168.110.112"
port = "1521"
dbName = "orcl"

engine = create_engine('oracle+cx_oracle://{}:{}@{}:{}/{}'.format(id,pw,ip,port,dbName)  ) 

paramData = pd.read_sql_query("select * from KOPO_PARAM_HANJIWON",engine)

In [25]:
paramData

   param_name                                        param_value
0   SRC_TABLE                                      kopo_bankdata
1  DEST_TABLE                             kopo_bankdata_hanjiwon
2    DEST_CON  oracle+cx_oracle://kopo:kopo@192.168.110.112:1...
3     SRC_CON  mysql+pymysql://kopo:kopo@192.168.110.111:3306...

In [26]:
src_con = paramData.loc[paramData.param_name == 'SRC_CON', "param_value"].values[0]
dest_con = paramData.loc[paramData.param_name == 'DEST_CON', "param_value"].values[0]
src_table =  paramData.loc[paramData.param_name == 'SRC_TABLE', "param_value"].values[0]
dest_table = paramData.loc[paramData.param_name == 'DEST_TABLE', "param_value"].values[0]

In [27]:
print(src_table)
print(dest_table)
print(src_con)
print(dest_con)

kopo_bankdata
kopo_bankdata_hanjiwon
mysql+pymysql://kopo:kopo@192.168.110.111:3306/kopo
oracle+cx_oracle://kopo:kopo@192.168.110.112:1521/orcl

# 2. 데이터 불러오기

In [28]:
import pandas as pd
from sqlalchemy import create_engine,types

engine = create_engine(dest_con) 

bankData = pd.read_sql_query('select * from {}'.format(dest_table), engine)

In [29]:
bankData

,bankid,age,sex,region,income,married,children,car,save_act,current_act,mortgage,pep
0,ID12101,48.0,None,INNER_CITY,17546.0,None,1.0,None,NO,NO,NO,YES
1,ID12102,40.0,MALE,TOWN,30085.1,YES,3.0,None,NO,YES,YES,NO
2,ID12103,51.0,FEMALE,INNER_CITY,NaN,None,0.0,YES,YES,YES,None,NO
3,ID12104,23.0,None,TOWN,20375.4,YES,3.0,NO,NO,YES,NO,NO
4,ID12105,57.0,FEMALE,RURAL,NaN,None,0.0,NO,YES,NO,NO,NO
...,...,...,...,...,...,...,...,...,...,...,...,...
595,ID12501,NaN,FEMALE,RURAL,19481.3,NO,0.0,NO,NO,YES,YES,YES
596,ID12502,26.0,MALE,RURAL,19563.8,NO,3.0,YES,NO,NO,YES,NO
597,ID12503,48.0,None,INNER_CITY,38598.4,YES,0.0,YES,NO,YES,NO,NO
598,ID12504,35.0,MALE,None,20754.3,NO,0.0,NO,NO,NO,YES,YES
599,ID12505,24.0,FEMALE,None,13864.6,YES,NaN,NO,None,YES,NO,YES

# 3. 데이터 저장하기

In [30]:
import pandas as pd
from sqlalchemy import create_engine,types

engine = src_con

bankData.to_sql(name=dest_table, 
                    con= engine, 
                    if_exists="replace", 
                    index = False)

600

In [31]:
# 성능향상 코드
# HUGECLOB 보완

tableName = dest_table
tableName = tableName.lower()
#### 문자컬럼에 대해서 varchar (100) 적용 _ 사용시 속도 SpeedUp 50배 
objectColumns = list(bankData.columns[bankData.dtypes == 'object'])
typeDict={}
maxLen = 100

for i in range(0, len(objectColumns)):
    # sawonData[i].str.len().max() 최대치 사용할 경우
    typeDict[ objectColumns[i] ] = types.VARCHAR(100)
#### 문자컬럼에 대해서 varchar (100) 적용 _ 사용시 속도 SpeedUp 50배 

bankData.to_sql(name=dest_table, if_exists="replace", con=engine,dtype=typeDict, index=False)

600